[{"Timestamp":"01/26/2020 12:03:20","Title":"Demystifying How Machines Learn","Type":"Talk Series","DateTime":"01/28/2020 17:00:00","Location":"GB 220","Summary":"The series will introduce the methodology of human psychology insights to solve unsupervised learning problems and build novel machine learning and mathematical models. The series is open to all audiences, especially those who are passionate about unsupervised learning and reinforcement learning.\nOur speaker, Nishkrit Desai, will lead this series. He is a student researcher involved in projects with organizations such as Google, Tesla, Autodesk, and OpenAI. His main interests are unsupervised learning and reinforcement learning.\nJoin us in uncovering exciting ideas in machine learning!\n","Image":"https://drive.google.com/open?id=1ofK_dJz-UH8rNe70xPTZFPkl2u6xubpa","PreLink":"http://eventbrite.ca/e/utmist-series-tickets-91480650087?fbclid=IwAR2-SbJ6CKWPs0KxWe490DrGjuQzQBnidm2jQc7dnk5HhWBXbBVKg8oGPJM","PostLink":"","filepath":"./files/1ofK_dJz-UH8rNe70xPTZFPkl2u6xubpa_Nishkrit.png"},{"Timestamp":"11/6/2019 15:12:20","Title":"Research Talk - Professor Pascal Poupart","Type":"Talk Series","DateTime":"11/12/2019 18:00:00","Location":"GB 303","Summary":" “Unsupervised Video Object Segmentation for Deep Reinforcement Learning”, by Professor Pascal Poupart. He will discuss a new technique for deep reinforcement learning that exploits flow film information, detects moving objects and uses their information for action selection.","Image":"https://drive.google.com/open?id=1z0iCc9LAygLdAj3zmvT1N8EGlk4oZYuL","PreLink":"https://tinyurl.com/y5qewaux","PostLink":"https://drive.google.com/open?id=1eLwFNgiLmVBHJ7wZCxcJIRjl3PTZR8zE","filepath":"./files/1z0iCc9LAygLdAj3zmvT1N8EGlk4oZYuL_research talk Pascal Poupart (wechat cover) - UTMIST.png"},{"Timestamp":"9/9/2019 22:57:13","Title":"The Second AI-Squared Forum","Type":"Forum","DateTime":"9/22/2019 8:30:00","Location":"BA Atrium","Summary":"AI Squared is a forum for facilitating dialogues across boundaries in the AI industry. It is a great opportunity to\n- Discuss big ideas with AI researchers working on cutting-edge projects\n- Network with recruiters from AI companies such as Uber ATG and Shopify to secure internship opportunities\n- Hear about the experience of undergraduates working at institutes such as the Vector Institute, Nvidia and Google\n- Connect with AI professors and professionals from academia and industry","Image":"https://drive.google.com/open?id=1efcEk4QMw4oePSEnYH8L_T-OZPF795hQ","PreLink":"http://www.aisquaredforum.ca/","PostLink":"","filepath":"./files/1efcEk4QMw4oePSEnYH8L_T-OZPF795hQ_23891568082268_.pic_hd - Zoe Zhou.jpg"},{"Timestamp":"9/9/2019 22:46:47","Title":"Annual General Meeting (AGM) 2019","Type":"Meeting","DateTime":"9/16/2019 18:00:00","Location":"BA 1170","Summary":"\nCome and meet the new executive team! We will be talking about a variety of events that will be held throughout the year. At the end of the AGM, project leads will also introduce new academic projects. They will meet with anyone interested in joining the project teams afterwards. Anyone applied/interested in applying for a project associate position is strongly encouraged to come and potentially find your team. ","Image":"https://drive.google.com/open?id=1fM0QovTlXhJFWAtJm3JG-qXiRio25tqO","PreLink":"https://www.facebook.com/events/662423500945082/","PostLink":"","filepath":"./files/1fM0QovTlXhJFWAtJm3JG-qXiRio25tqO_23871568082257_.pic_hd - Zoe Zhou.jpg"},{"Timestamp":"4/21/2019 0:54:23","Title":"Exploration in Reinforcement Learning","Type":"Paper Reading","DateTime":"4/25/2019 18:30:00","Location":"BA 1230","Summary":"Sicong (Sheldon) Huang is currently an undergrad at U of T. His research interests include machine learning and cognitive science. Currently he is a research intern at Vector Institute and Borealis AI, where he works on evaluating generative models. Previously he worked on deep generative models for domain transfer on text and music, such as TimbreTron (ICLR2019) and CipherGAN (ICLR2018). Currently he is interested in some fundamental questions regarding learning and cognition. He also co-founded two organizations in his free time including UTMIST and FOR.ai, an international distributed AI research collaboration.\nHe will be giving a broad introduction on exploration strategies in Reinforcement Learning. Exploration vs. exploitation trade-off is one of the core problem in modern deep reinforcement learning especially when the environment is complex and partially observable. Exploiting the best actions based on the current policy can yield a very good short-term return, but can easily get the agent stuck in a local minimum. The goal of this paper reading group is to demystify the principle behind the deep RL exploration problem. The topics of this paper reading group range from optimistic exploration, posterior sampling to information gain in exploration. In addition to those traditional approaches, Sheldon will also be going over several state-of-the-art approaches in the field.","Image":"https://drive.google.com/open?id=1LxvQOnFPTSWfN104C4O0li-QM8lA-OGV","PreLink":"https://www.eventbrite.ca/e/paper-reading-group-exploration-in-reinforcement-learning-tickets-60437076924?fbclid=IwAR1ZBZ1N6t_0yMl5fhqcVexo6N1A-tcq4vI9gnLrS9TZU6-9UgVuEVEDGdk","PostLink":"","filepath":"./files/1LxvQOnFPTSWfN104C4O0li-QM8lA-OGV_banner - UTMIST.jpg"},{"Timestamp":"2/27/2019 23:51:49","Title":"Using ML Method on Assessing Drivers' Vigilance","Type":"Talk Series","DateTime":"3/12/2019 18:30:00","Location":"BA 1180","Summary":"Speaker: Min Liang\nMin is currently working as a data scientist at RBC after receiving her master’s degree in electrical engineering from McGill University. She has had fruitful research experience in ECE from Tianjin University, Harvard University, MITACS and McGill University.\nThis talk session will be featuring her MITACS research project at Alcohol Countermeasure System Corp., an alcohol tester design company, in 2017. The overall objective is to reliably assess drivers’ vigilance using non-intrusive measures. The data used for this project are collected by Smart Eye Pro, an eye-tracking system. The research project mainly focuses on identifying the most important features and building classification/regression systems to reliably detect drowsiness and fatigue.\nJoin us on March 12th. Get inspired, make connections and learn new skills from this talk session!","Image":"https://drive.google.com/open?id=1p-Evp_xp0JSvx57iUhwApfjR6ebH-_a3","PreLink":"https://www.eventbrite.ca/e/utmist-talk-seriesusing-ml-method-on-assessing-drivers-vigilance-tickets-57436161104","PostLink":"https://drive.google.com/file/d/0B-fqacY8JHB0RkFyeDVhRDZUQ0t5Y2ptWnBuZW0zcDZpLU84/view?usp=sharing","filepath":"./files/1p-Evp_xp0JSvx57iUhwApfjR6ebH-_a3_Academic Talk 5 - UTMIST.png"},{"Timestamp":"2/27/2019 23:49:47","Title":"The Effect of ASR on Alzheimer's Detection","Type":"Talk Series","DateTime":"3/5/2019 18:30:00","Location":"BA 1130","Summary":"Ever wondered how Machine Learning works for medical diagnostics? If so, don’t miss this insightful guest speaker talk given by Jekaterina Novikova. We are honoured to invite her to talk about the effect of ASR (automatic speech recognition) on classification performance in Alzheimer's detection.\n\nJekaterina is a director of Machine Learning at Winterlight Labs, where they focus on developing a novel AI technology that can quickly and accurately quantify speech and language patterns to help detect and monitor cognitive and mental diseases. Previously, she received her PhD from University of Bath. She also worked as a post-doctoral researcher at Heriot-Watt University in Edinburgh, UK, at the Interaction Lab and Natural Language Processing Lab.\n\nJoin us on March 5th for this insightful speaker session and learn from this excellent machine learning researcher!","Image":"https://drive.google.com/open?id=1pIzt9_T_moOBums_H3qXz7MCQ1Pq1KVL","PreLink":"https://www.eventbrite.ca/e/utmist-talk-seriesthe-effect-of-asr-on-alzheimers-detection-tickets-57435568331","PostLink":"","filepath":"./files/1pIzt9_T_moOBums_H3qXz7MCQ1Pq1KVL_Academic Talk 4 - UTMIST.png"},{"Timestamp":"2/24/2019 13:03:44","Title":"Computer Vision","Type":"MIST101","DateTime":"2/5/2019 18:30:00","Location":"SS 2102","Summary":"This workshop covers basic knowledge of recent advances in computer vision. We’ll introduce the commonly used tools and models in solving computer vision tasks and explore how the frontier computer vision research is accelerating integration to real-life scenarios. Following that, we will demo a typical workflow for CV projects.","Image":"https://drive.google.com/open?id=14EBnu_cJDMBmdEOAUo6RgAXtrdwNVH-0","PreLink":"","PostLink":"https://docs.google.com/presentation/d/1cTKYWHvt-TgfxHylphhJPBsj9HlQGd3fOpzLv9GBJlk/edit?usp=sharing","filepath":"./files/14EBnu_cJDMBmdEOAUo6RgAXtrdwNVH-0_MIST101 3 - hongyu chen.png"},{"Timestamp":"2/24/2019 13:07:32","Title":"Machine Learning for Recommender Systems","Type":"Talk Series","DateTime":"11/27/2018 18:30:00","Location":"SS 1074","Summary":"Recommender systems are intelligent machine learning systems that help customers discover personalized products from a dynamic pool of diverse choices. In this talk, Soon Chee Loong from Data-Driven Decision Making Laboratory will share his insights on different types of recommender systems, their challenges, and various seminal approaches to tackle them.","Image":"https://drive.google.com/open?id=1zw9zqJTfrzvOaWkRCGmWdk51W6U-Ti0N","PreLink":"","PostLink":"https://scheeloong.github.io/pdf/RecommenderSystemMotivationChallengesSeminalWorks.pdf","filepath":"./files/1zw9zqJTfrzvOaWkRCGmWdk51W6U-Ti0N_Academic Talk Copy 4 - hongyu chen.png"},{"Timestamp":"2/24/2019 13:14:27","Title":"Detecting Alzheimer's Disease","Type":"Talk Series","DateTime":"11/20/2018 18:30:00","Location":"SS 1074","Summary":"We had the honour to invite Jekaterina Novikova to talk about Machine Learning Methods in Detecting Alzheimer's Disease from Speech and Language. Jekaterina is a Director of Machine Learning at Winterlight Labs, where they focus on developing a novel AI technology that can quickly and accurately quantify speech and language patterns to help detect and monitor cognitive and mental diseases.","Image":"https://drive.google.com/open?id=1T50cSBLmvFrnX1R96WUIa2Wl_Vk1yS0t","PreLink":"","PostLink":"https://drive.google.com/file/d/1Q6LtRI_KjzDPwpez5Pt0hs5nr7ew8bGy/view?usp=sharing","filepath":"./files/1T50cSBLmvFrnX1R96WUIa2Wl_Vk1yS0t_46212235_1042309389227738_6792329738825236480_n - hongyu chen.jpg"},{"Timestamp":"2/24/2019 13:23:50","Title":"Reinforcement Learning","Type":"MIST101","DateTime":"11/19/2018 18:30:00","Location":"GB 220","Summary":"Lunjun Zhang will be providing an enriched introduction to reinforcement learning, one of the most active fields of AI research today. The workshop will cover both the fundamental ideas and several state-of-the-art methods including value iteration, policy gradients, actor critic, Q learning, and exploration strategies. The workshop will also explore how concepts from optimisation and information theory are used for control.","Image":"https://drive.google.com/open?id=1vLkYN0xR9y7KH0dOcyTmAuB_gXC3JrKa","PreLink":"","PostLink":"http://www.cs.toronto.edu/~lunjun/an_odyssey_in_deep_rl.pdf","filepath":"./files/1vLkYN0xR9y7KH0dOcyTmAuB_gXC3JrKa_46294130_1041229766002367_3140304070485475328_n - hongyu chen.jpg"},{"Timestamp":"2/24/2019 13:28:37","Title":"Introduction to Machine Learning","Type":"MIST101","DateTime":"11/8/2018 18:30:00","Location":"","Summary":"A general introduction to machine learning fundamentals and a demonstration of typical workflow in solving machine learning problems. The typical workflow is demonstrated here: https://youtu.be/4flbCsGBicE","Image":"https://drive.google.com/open?id=1DdrIBgyt1f0aWGY_hytbIZQ7tcqNagN2","PreLink":"","PostLink":"https://docs.google.com/presentation/d/1v68ag3A9trfvPtHfsv40KyHhi4Q1WQrIU6eUgiZKB74/edit?usp=sharing","filepath":"./files/1DdrIBgyt1f0aWGY_hytbIZQ7tcqNagN2_MIST101 1 - hongyu chen.PNG"},{"Timestamp":"2/24/2019 13:30:39","Title":"Machine Translations","Type":"Talk Series","DateTime":"10/30/2018 18:30:00","Location":"ES B149","Summary":"We had the honour to invite Jun Gao to talk about Recent Advances in Neural Machine Translation. Jun Gao graduated from Peking University with fruitful experiences gained from working in both academia and industry. Currently, he is a graduate student in the Machine Learning Group here at UofT.","Image":"https://drive.google.com/open?id=1dUgMXjcXdL5ysxonERq7KtSbVjJpMa82","PreLink":"","PostLink":"https://medium.com/@utorontomist/machine-translation-today-78dd8bd1158c","filepath":"./files/1dUgMXjcXdL5ysxonERq7KtSbVjJpMa82_44967341_1020691324722878_7602628280457363456_n - hongyu chen.jpg"},{"Timestamp":"3/5/2019 0:42:41","Title":"Using Deep Learning to Analyze Typhoon Images","Type":"Paper Reading","DateTime":"10/23/2018 18:30:00","Location":"ES B149","Summary":"Speaker: Danlan Chen\nMachine Learning Researcher at Borealis AI, the machine learning research department at RBC\nMaster’s from McGill University, where she did research in Machine Learning in the Reasoning & Learning Lab under the supervision of Professor Doino Precup.\nCheck out her personal website: https://danlanchen.github.io/","Image":"https://drive.google.com/open?id=1ofWnNQ3LZHlgQnJatACQULdw-KmckOZn","PreLink":"https://www.eventbrite.ca/e/utmist-paper-reading-group-2-tickets-51538377675?fbclid=IwAR36qBGu2jHIIHKhYrL-Ah6QU6qAAJmfd-CU9gD8PTjpesFEjctgZ5Ph91I","PostLink":"","filepath":"./files/1ofWnNQ3LZHlgQnJatACQULdw-KmckOZn_Typoon - UTMIST.PNG"},{"Timestamp":"2/24/2019 13:40:32","Title":"Deep Learning on Graphs: CNN, RNN, GNN","Type":"Paper Reading","DateTime":"10/9/2018 18:30:00","Location":"GB 220","Summary":"We are hosting the first session of our research paper reading group series on Graph Neural Net on Computer Vision Problems with Arie Huan Ling from NVIDIA AI Research lab and Vector Institute as our guest speaker!","Image":"https://drive.google.com/open?id=1u2I1s0vELbVRq888-IObR5DAc1NbGNaZ","PreLink":"","PostLink":"https://medium.com/@utorontomist/deep-learning-on-graphs-for-computer-vision-cnn-rnn-and-gnn-c114d6004678","filepath":"./files/1u2I1s0vELbVRq888-IObR5DAc1NbGNaZ_43161158_998097003648977_5971235328743178240_n - hongyu chen.jpg"},{"Timestamp":"2/24/2019 13:46:58","Title":"Annual General Meeting (AGM) 2018","Type":"Meeting","DateTime":"9/13/2018 18:30:00","Location":"","Summary":"UTMIST’s mission is to clear the mist around Machine Learning and create a platform of opportunities for UofT students to get involved in the ML community in Toronto. This year we are hoping to bond with more AI/ML enthusiasts, no matter with previous experience or not. MIST101 will stay with a re-structured format for new-comers while more hands-on projects and deeper study with researchers on state-to-art techniques are provided.","Image":"https://drive.google.com/open?id=14gpyI5FR71T76t3viPMSJetKMTOncUCK","PreLink":"","PostLink":"https://docs.google.com/presentation/d/1bc5wusrhi2TleboWbvcSnwKfR4q-Y8_OnyDyvUeLYaQ/edit?usp=sharing","filepath":"./files/14gpyI5FR71T76t3viPMSJetKMTOncUCK_Copy of DSC05272 - hongyu chen.jpg"}]