[{"Timestamp":"6/16/2019 16:40:56","Title":"VP Communications","Detailed Description":"VP Communications serves as the lubricant within the UTMIST exec team. The role communicates across sectors and intervenes when misunderstanding or ineffective work happens. The role works on team dynamics regularly. \nResponsibility: \n\n- Being a vice president, discuss on meetings with the president and other VPs to make decisions on UTMIST’s directions\n- Lead the sector of communications to maintain the club’s website, medium, twitter, email, and facebook accounts\n- Work with VP logistics to promote intra-team effective communication\n- Work with VP marketing to maintain the club’s influence\n\nWhy would you want to become a VP Communications?\n- It’s an opportunity for you to consistently apply your excellent team skills on valuable programs and have sustained impacts on UofT undergraduate and graduate students. \n- You will be interacting with a large group of people where your communication and leadership skills can be demonstrated.  \n\nWhat we are looking for\n- Articulation skills for self and representing a team\n- Open-minded to different possibilities for a situation\n- Strong time management skills","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Communications Associate","Detailed Description":"Responsibility: \n- Maintain twitter, newsletter, email and facebook interactions (see “the whole sector” for detailed responsibilities) \n- Lead web developers and technical writers to improve UTMIST’s website and Medium publications\n\nWhy would you want to become a communication associate?\n- Realize your ideas on how to represent UTMIST to the outside world\n- Practice on a daily basis the most important soft skill in the workspace\n- Make strong connections to UTMIST’s driven and prospective execs\n\nWhat we are looking for\n- Passionate about building connections and talking to people\n- Confident in English speaking and writing","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"6/16/2019 16:58:40","Title":"Technical Writer","Detailed Description":"Technical writers have a mission to bring UTMIST resources beyond the University of Toronto Campus. \n\nResponsibility: \n- Attend UTMIST learning events in person\n- Utilize UTMIST and online resources to fully understand the material\n- Produce high-quality articles on our Medium platform\n\nWhy would you want to become a technical writer?\n- A great way to learn if you are not yet ready to do projects\n- Demonstrate soft skills to employers\n- Potential to join project teams after\n\nWhat we are looking for\n- Strong writing skills\n- Solid fundamentals in mathematics and probably programming. Machine learning experience not required\n- Unstoppable curiosity","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Web Developer","Detailed Description":"UTMIST is actively exploring possibilities on the web platform to improve the experience of sponsors, speakers, and students.\n \nResponsibility: \n- Develop new features of UTMIST’s online presence\n- Iterate on the existing web code base for changing needs\n- Suggest different ways to improve UTMIST’s online experience\n\nWhy would you want to be a web developer at UTMIST?\n- Deployment on the web is the last mile for any ML model\n- You will be mentored by a web developer with industry experience\n- Potential to collaborate with project teams to productionize findings\n\nWhat we are looking for\n- You know AI and are interested in Web, or know Web and are interested in AI\n- Strong software development background\n- Know what UX is, and why it is important","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Photographer","Detailed Description":"UTMIST puts great efforts on benefiting more people with the current resources we have. Therefore, it’s vital to keep visual records of our self-created workshop series,  projects, as well as guest speaker talks. \n\nResponsibility: \n- Take turns to attend UTMIST events in person and record the audio/video of event content\n- Record memorable moments of events and project teams visually \n- Curate pictures and build a gallery of UTMIST \n\nWhy would you want to be a photographer at UTMIST?\n- Spread valuable information to a larger audience, especially students thirsty for knowledge and opportunities \n- Work with many other prospective students while having your own unique skill in the team\n\nWhat we are looking for\n- Understood framing, color and light to create a visually pleasing photograph\n- (Amateur or beyond) Journalistic photography skill\n- Adequate commitment to physically attend the events ","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"VP Logistics + Associates","Detailed Description":"Logistics Department Collective Responsibilities\nWork with other VPs to design events for members to develop machine learning knowledge\nAssign deadlines to tasks for each department in the club in order to ensure successful and timely execution of a specific event. Supervise the completion of each task. Adjust the deadlines to unforeseen changes. \nManage club membership at ULife, UTSU and EngSoc. Execute mandatory tasks that ULife gives to maintain UTMIST as an official club office space owner.\nBook rooms, media equipment and food & refreshments for events. Work with External Onsite Associate to set up events on site\nOrganize team socials and team building events \nCollect feedback and report them to the relevant departments\n\nWhy would you want to be a VP Logistics/ Logistics Associate at UTMIST?\nOpportunity to build connections with other execs who are driven and passionate in ML \nOpportunity to represent UTMIST at events and network with invited professionals\nApply your invisible qualities(patience, detail-oriented, people skills) to improve the result of UTMIST event\n\nWhat we are looking for (as an ideal VP) \nStrong coordination and scheduling skills\nInterpersonal and leadership skills \nCreativity and experience in event programming\nDetail-oriented \n(The most qualified candidate(s) will be considered for the position of VP.)","Spots Remaining":null,"Department":"Logistics"},{"Timestamp":"","Title":"VP External","Detailed Description":"Responsibility: \n- Lead External PR Associates to reach out, build and maintain connections with departments, clubs, organizations, companies, and institutions inside or outside of UofT for possible partnerships\n- Lead External PR Associates to attract professionals, funding, promotion platforms and many other resources to help host events and expand UTMIST\n- Collaborate with other VPs for club events and affairs\n- Lead External On-site Associates to facilitate guests at events\n\nWhy would you want to be a VP External at UTMIST?\n- Have the opportunity to be part of our core executive team, managing the external team and making critical decisions\n- Make connections with graduate students, professors, industry experts in AI/ML field\n- Learn how to act and speak as a public relations person, understanding and using the power of communication\n- Gain lots of experience in managing a team and holding events\n- And MORE!  \n\nWhat we are looking for\n- Enthusiastic, have a great sense of responsibility\n- Capable of multitasking\n- Great communication (both oral and written) skills in English\n- Past experience in Public Relations and Sponsorship is an asset","Spots Remaining":null,"Department":"External"},{"Timestamp":"","Title":"External Associates (Public Relations)","Detailed Description":"Responsibility: \nWork with VP External to find and attract professionals or organizations that may have an interest in supporting UTMIST\nHelp VP External with reaching out to external resources and preparing sponsorship package\n\nWhy would you want to be an External PR Associate at UTMIST?\nMake connections with graduate students, professors, industry experts in AI/ML field\nAble to learn from an experienced VP External closely\nHave lots of opportunities to practice and grow effective communication skills\nAnd MORE!  \n\nWhat we are looking for\nPassionate at communicating in English (both formally and casually) \nAn enthusiastic attitude \nA great sense of responsibility\nPast experience in Public Relations and Sponsorship is an asset","Spots Remaining":null,"Department":"External"},{"Timestamp":"","Title":"External On-site Associates","Detailed Description":"Responsibility: \n- Facilitate the event and accommodate guest speakers/judges at events\n- Work with logistic associates on event programming \n- Resolve unexpected situations at events\n\nWhy would you want to be an External On-site Associate at UTMIST?\n- Be the representative of UTMIST at events\n- Make connections with invited guests and attendees in AI, ML and various fields\n- Practice public speaking and responding to unforeseen situations\n- And MORE!  \n\nWhat we are looking for\n- Comfortable in public speaking in English \n- Passionate in onsite facilitating and having live conversations \n- Past experience as a public speaker is an asset","Spots Remaining":null,"Department":"External"},{"Timestamp":"","Title":"VP Finance","Detailed Description":"Responsibility:\n- Being a vice president, discuss on meetings with the president and other VPs to make decisions on UTMIST’s directions\n- Lead the sector of finance to maintain oversee club’s budget and provide strategic plans to maintain a healthy financial position\n- Secure funding from UTSU and EngSoc\n- Work with VP Sponsorship to secure sponsorship opportunities\n\nWhy would you want to be VP Finance?\n- Running the financials of a club is surprisingly similar to running a small company. It prepares you well for a career in finance.\n- Light time commitment while being able to connect with a group of driven students and be involved in ML community \n\nWhat we are looking for (as an ideal candidate) \n- Previous experience dealing with EngSoc or UTSU\n- Previous experience in VP finance position\n- Accounting experience would be a plus\n- Personality-wise, be responsible","Spots Remaining":null,"Department":"Finance"},{"Timestamp":"","Title":"Marketing Associates","Detailed Description":"Responsibility:\nDevelop and implement strategies with the marketing team\nContribute to collaborative efforts and organize promotional events\nConduct market research to identify new opportunities\nCoordinate with the Academic and External teams to prepare advertising contents\nCoordinate with the Design and Content teams to make advertising post on Social Networks\n\nWhy would you want to be a marketing associate?\nGrow your creativity\nGrow your ability to attract attention delightfully and promote valuable ideas\nWork extensively with teammates, develop communication skills and efficient teamwork\n\nWhat we are looking for (as an ideal candidate) \nExcellent English or Mandarin writing skills \nTime-management and organizational skills\nPrevious experience in article writing\nCreativity and marketing sense is a plus","Spots Remaining":null,"Department":"Marketing"},{"Timestamp":"","Title":"Graphics Designer","Detailed Description":"Responsibility:\n- Design posters for event promotions\n- Manage the consistency of graphic style of UTMIST publications (newsletter, sponsorship package, website, logo, banner etc. )\n\nWhy would you want to be a graphic designer at UTMIST?\n- Help promote a meaningful club and its events \n- Enrich your profile by contributing to more designs\n- Grow aesthetic judgement and design skills\n- Work closely with a group of students who have insights and knowledge of ML\n\nWhat we are looking for \n- Familiar with basic digital graphics design tools (e.g. Photoshop, Illustrator).\n- Prior experience in graphic design is desirable but not mandatory","Spots Remaining":null,"Department":"Marketing"},{"Timestamp":"","Title":"VP Academics","Detailed Description":"Responsibility:\n- Lead academic related events, including but not limited to\n- overseeing internal projects, provide suitable guidance for each project team; work with project directors to set milestones and goals for the project.  \n- preparing academic materials, such as MIST101 workshop slides.\n- assisting workshop/reading group organization, provide academic support for marketing/external/communication sectors.\n- Develop new academic events\n- project/competition-based event to encourage students to practice ML.\n- talk-based event to bring in latest ML development to the student audience, and to create opportunities for them to connect with peers & professionals. \n- Work with external on event cooperation with other student clubs, notable ideas include hackathon and workshops.\n\nWhy would you want to be a VP Academics at UTMIST?\n- Learn and practice leadership & teamwork \n- Get exposed to a wide variety of exciting work\n- Chance to interact with excellent researchers/industry practitioners\n\nWhat we are looking for\n- Passionate about machine learning\n- Experienced with common practices\n- Aware of the latest developments in the field\n- Enjoy sharing to our student audience, spark interests and incentivize more people to join us","Spots Remaining":null,"Department":"Academics"},{"Timestamp":"","Title":"Project Directors ","Detailed Description":"Responsibility: \n- Lead a term-based project as part of our effort towards contributing to the ML/AI community. (You/Your Project members are free to choose your topic of interest and pursue an exciting learning/practicing experience as a team. )\n- Set project milestones and goals, report progress to VP Academics.\n- Provide guidance and technical support to team members, encourage close teamwork and make sure the team is on the same pace\n\nWhy would you want to be a Project Director at UTMIST?\n- Able to learn effective teamwork and leadership \n- Go in-depth on machine learning and specifically on your selected topic\n- Enrich your profile with a brilliant machine learning project and unique leadership experience \n- Connect with and learn from motivated peers. \n\nWhat we are looking for? \n- Motivated, responsible and enjoy teamwork\n- (Strongly suggest) have ideas in mind that you want to pursue + prior knowledge in related domains, which will be of great help to the success of the project","Spots Remaining":null,"Department":"Academics"},{"Timestamp":"","Title":"Project Associates","Detailed Description":"Responsibility: \n- Assist VP Academics and the project directors in terms of event preparation and internal projects. (You have the option to focus on either or both as long as your time/commitment permits.)\n\nWhy would you want to be a Project Associate at UTMIST?\n- A great way to kick-start your learning in ML/AI\n- Meet with passionate peers, enrich your exposure to the diversity of the field \n- Every member will have prioritized opportunities to join our workshops/reading groups/other events, so you can get a unique advantage in learning and networking. \n\nWhat we are looking for\n- Passionate about machine learning but most importantly willing to learn\n- Enjoy the teamwork and responsible \n- Prior experience in ML or software development will be a bonus","Spots Remaining":null,"Department":"Academics"}]