[{"Timestamp":"6/16/2019 16:40:56","Title":"VP Communications","Detailed Description":"VP Communications serves as the lubricant within the UTMIST exec team. The role communicates across sectors and intervenes when misunderstanding or ineffective work happens. The role work on team dynamics regularly.\n \nBeing a vice president, discuss on meetings with president and other vps to make decisions on UTMIST’s directions\n- Lead the sector of communications to maintain club’s website, medium, twitter, email, and facebook accounts\n- Work with VP logistics to promote intra-team effective communication\n- Work with VP marketing to maintain club’s influence\n\nWhy would you want to become a VP Communications?\n- It’s an opportunity for you to consistently apply your excellent team skills on valuable programs and have sustained impacts on UofT undergraduate and graduate students. \n- You will be interacting with a large group of people where your communication and leadership skills can be demonstrated.  \n\nWhat we are looking for\n- Articulation skills for self and representing a team\n- Open-minded to different possibilities for a situation\n- Strong time management skills","Spots Remaining":1,"Department":"Communications"},{"Timestamp":"6/16/2019 16:58:40","Title":"Technical Writer","Detailed Description":"Technical writers have a mission to bring UTMIST resources beyond the University of Toronto Campus. In particular, the role will \n- Attend UTMIST learning events in person\n- Utilize UTMIST and online resources to fully understand the material\n- Produce high quality articles on our Medium platform\n\nWhy would you want to become a technical writer?\n- A great way to learn if you are not yet ready to do projects\n- Demonstrate soft skills to employers\n- Potential to join project teams after\n\nWhat we are looking for\n- Strong writing skills\n- Solid fundamentals in mathematics and probably programming. Machine learning experience not required\n- Unstoppable curiosity","Spots Remaining":2,"Department":"Communications"},{"Timestamp":"","Title":"Communication Associate","Detailed Description":"Communication associates will share tasks to \n- Maintain twitter, newsletter, email and facebook interactions (see “the whole sector” for detailed responsibilities) \n- Lead web developers and technical writers to improve UTMIST’s website and Medium publications\n\nWhy would you want to become a communication associate?\n- Realize your ideas on how to represent UTMIST to the outside world\n- Practice on a daily basis the most important soft skill in the workspace\n- Make strong connections to UTMIST’s driven and prospective execs\n\nWhat we are looking for\n- Passionate in building connections and talking to people\n- Confident in English speaking and writing\n","Spots Remaining":2,"Department":"Communications"},{"Timestamp":"","Title":"Web Developer","Detailed Description":"UTMIST is actively exploring possibilities on the web platform to improve the experience of sponsors, speakers, and students. The role will\n- Develop new features of UTMIST’s online presence\n- Iterate on existing web code base for changing needs\n- Suggest different ways to improve UTMIST’s online experience\n\nWhy would you want to be a web developer at UTMIST?\n- Deployment on the web is the last mile for any ML model\n- You will be mentored by a web developer with industry experience\n- Potential to collaborate with project teams to productionize findings\n\nWhat we are looking for\n- You know AI and are interested in Web, or know Web and are interested in AI\n- Strong software development background\n- Know what UX is, and why it is important\n","Spots Remaining":1,"Department":"Communications"},{"Timestamp":"","Title":"Photographer","Detailed Description":"UTMIST puts great efforts on benefiting more people with current resources we have. Therefore, it’s vital to keep visual records of our self-created workshop series, projects, as well as guest speaker talks. Photographers will\n- Take turns to attend UTMIST events in person and record the audio/video of event content\n- Record memorable moments of events and project teams \n- Curate pictures and build a gallery of UTMIST \n\nWhy would you want to be a photographer at UTMIST?\n- Spread valuable information to more audience, especially students thirsty for knowledge and opportunities \n- Work with many other prospective students while having your own unique skill in the team\n\nWhat we are looking for\n-Understood framing, color and light to create a visually pleasing photograph\n(Amateur or beyond) Journalistic photography skill\n- Adequate commitment to physically attend the events \n","Spots Remaining":2,"Department":"Communications"}]