[{"Title":"Photographer","Department":"Marketing","Detailed Description":"UTMIST puts great efforts on benefiting more people with the current resources we have. Therefore, it’s vital to keep visual records of our self-created workshop series,  projects, as well as guest speaker talks. \n\nResponsibility: \n- Take turns to attend UTMIST events in person and record the audio/video of event content\n- Record memorable moments of events and project teams visually \n- Curate pictures and build a gallery of UTMIST \n\nWhy would you want to be a photographer at UTMIST?\n- Spread valuable information to a larger audience, especially students thirsty for knowledge and opportunities \n- Work with many other prospective students while having your own unique skill in the team\n\nWhat we are looking for\n- Understood framing, color and light to create a visually pleasing photograph\n- (Amateur or beyond) Journalistic photography skill\n- Adequate commitment to physically attend the events ","Number":"1","Instructions":"","Deadline":"","Spots Remaining":null},{"Title":"Graphics Designer","Department":"Marketing","Detailed Description":"Responsibility:\n- Design posters for event promotions\n- Manage the consistency of graphic style of UTMIST publications (newsletter, sponsorship package, website, logo, banner etc. )\n\nWhy would you want to be a graphic designer at UTMIST?\n- Help promote a meaningful club and its events \n- Enrich your profile by contributing to more designs\n- Grow aesthetic judgement and design skills\n- Work closely with a group of students who have insights and knowledge of ML\n\nWhat we are looking for \n- Familiar with basic digital graphics design tools (e.g. Photoshop, Illustrator).\n- Prior experience in graphic design is desirable but not mandatory","Number":"1","Instructions":"","Deadline":"","Spots Remaining":null},{"Title":"Software Developer","Department":"Infrastructure","Detailed Description":"","Number":"2","Instructions":"","Deadline":"","Spots Remaining":null}]