[{"Timestamp":"6/16/2019 16:40:56","Title":"VP Communications","Detailed Description(feel free to edit as desired)":"VP Communications serves as the lubricant within the UTMIST exec team. The role communicates across sectors and intervenes when misunderstanding or ineffective work happens. The role works on team dynamics regularly. \nResponsibility: \n\n- Being a vice president, discuss on meetings with the president and other VPs to make decisions on UTMIST’s directions\n- Lead the sector of communications to maintain the club’s website, medium, twitter, email, and facebook accounts\n- Work with VP logistics to promote intra-team effective communication\n- Work with VP marketing to maintain the club’s influence\n\nWhy would you want to become a VP Communications?\n- It’s an opportunity for you to consistently apply your excellent team skills on valuable programs and have sustained impacts on UofT undergraduate and graduate students. \n- You will be interacting with a large group of people where your communication and leadership skills can be demonstrated.  \n\nWhat we are looking for\n- Articulation skills for self and representing a team\n- Open-minded to different possibilities for a situation\n- Strong time management skills","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Communications Associate","Detailed Description(feel free to edit as desired)":"Responsibility: \n- Maintain twitter, newsletter, email and facebook interactions (see “the whole sector” for detailed responsibilities) \n- Lead web developers and technical writers to improve UTMIST’s website and Medium publications\n\nWhy would you want to become a communication associate?\n- Realize your ideas on how to represent UTMIST to the outside world\n- Practice on a daily basis the most important soft skill in the workspace\n- Make strong connections to UTMIST’s driven and prospective execs\n\nWhat we are looking for\n- Passionate about building connections and talking to people\n- Confident in English speaking and writing","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Photographer","Detailed Description(feel free to edit as desired)":"UTMIST puts great efforts on benefiting more people with the current resources we have. Therefore, it’s vital to keep visual records of our self-created workshop series,  projects, as well as guest speaker talks. \n\nResponsibility: \n- Take turns to attend UTMIST events in person and record the audio/video of event content\n- Record memorable moments of events and project teams visually \n- Curate pictures and build a gallery of UTMIST \n\nWhy would you want to be a photographer at UTMIST?\n- Spread valuable information to a larger audience, especially students thirsty for knowledge and opportunities \n- Work with many other prospective students while having your own unique skill in the team\n\nWhat we are looking for\n- Understood framing, color and light to create a visually pleasing photograph\n- (Amateur or beyond) Journalistic photography skill\n- Adequate commitment to physically attend the events ","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Graphics Designer","Detailed Description(feel free to edit as desired)":"Responsibility:\n- Design posters for event promotions\n- Manage the consistency of graphic style of UTMIST publications (newsletter, sponsorship package, website, logo, banner etc. )\n\nWhy would you want to be a graphic designer at UTMIST?\n- Help promote a meaningful club and its events \n- Enrich your profile by contributing to more designs\n- Grow aesthetic judgement and design skills\n- Work closely with a group of students who have insights and knowledge of ML\n\nWhat we are looking for \n- Familiar with basic digital graphics design tools (e.g. Photoshop, Illustrator).\n- Prior experience in graphic design is desirable but not mandatory","Spots Remaining":null,"Department":"Marketing"},{"Timestamp":"","Title":"Project Associates","Detailed Description(feel free to edit as desired)":"Responsibility: \n- Assist VP Academics and the project directors in terms of event preparation and internal projects. (You have the option to focus on either or both as long as your time/commitment permits.)\n\nWhy would you want to be a Project Associate at UTMIST?\n- A great way to kick-start your learning in ML/AI\n- Meet with passionate peers, enrich your exposure to the diversity of the field \n- Every member will have prioritized opportunities to join our workshops/reading groups/other events, so you can get a unique advantage in learning and networking. \n\nWhat we are looking for\n- Passionate about machine learning but most importantly willing to learn\n- Enjoy the teamwork and responsible \n- Prior experience in ML or software development will be a bonus","Spots Remaining":null,"Department":"Academics"}]