[{"Timestamp":"6/16/2019 16:40:56","Title":"VP Communications","Detailed Description":"VP Communications serves as the lubricant within the UTMIST exec team. The role communicates across sectors and intervenes when misunderstanding or ineffective work happens. The role work on team dynamics regularly.\n \nBeing a vice president, discuss on meetings with president and other vps to make decisions on UTMIST’s directions\n- Lead the sector of communications to maintain club’s website, medium, twitter, email, and facebook accounts\n- Work with VP logistics to promote intra-team effective communication\n- Work with VP marketing to maintain club’s influence\n\nWhy would you want to become a VP Communications?\n- It’s an opportunity for you to consistently apply your excellent team skills on valuable programs and have sustained impacts on UofT undergraduate and graduate students. \n- You will be interacting with a large group of people where your communication and leadership skills can be demonstrated.  \n\nWhat we are looking for\n- Articulation skills for self and representing a team\n- Open-minded to different possibilities for a situation\n- Strong time management skills","Spots Remaining":1,"Department":"Communications"},{"Timestamp":"","Title":"Communications Associate","Detailed Description":"Communication associates will share tasks to \n- Maintain twitter, newsletter, email and facebook interactions (see “the whole sector” for detailed responsibilities) \n- Lead web developers and technical writers to improve UTMIST’s website and Medium publications\n\nWhy would you want to become a communication associate?\n- Realize your ideas on how to represent UTMIST to the outside world\n- Practice on a daily basis the most important soft skill in the workspace\n- Make strong connections to UTMIST’s driven and prospective execs\n\nWhat we are looking for\n- Passionate in building connections and talking to people\n- Confident in English speaking and writing\n","Spots Remaining":2,"Department":"Communications"},{"Timestamp":"6/16/2019 16:58:40","Title":"Technical Writer","Detailed Description":"Technical writers have a mission to bring UTMIST resources beyond the University of Toronto Campus. In particular, the role will \n- Attend UTMIST learning events in person\n- Utilize UTMIST and online resources to fully understand the material\n- Produce high quality articles on our Medium platform\n\nWhy would you want to become a technical writer?\n- A great way to learn if you are not yet ready to do projects\n- Demonstrate soft skills to employers\n- Potential to join project teams after\n\nWhat we are looking for\n- Strong writing skills\n- Solid fundamentals in mathematics and probably programming. Machine learning experience not required\n- Unstoppable curiosity","Spots Remaining":2,"Department":"Communications"},{"Timestamp":"","Title":"Web Developer","Detailed Description":"UTMIST is actively exploring possibilities on the web platform to improve the experience of sponsors, speakers, and students. The role will\n- Develop new features of UTMIST’s online presence\n- Iterate on existing web code base for changing needs\n- Suggest different ways to improve UTMIST’s online experience\n\nWhy would you want to be a web developer at UTMIST?\n- Deployment on the web is the last mile for any ML model\n- You will be mentored by a web developer with industry experience\n- Potential to collaborate with project teams to productionize findings\n\nWhat we are looking for\n- You know AI and are interested in Web, or know Web and are interested in AI\n- Strong software development background\n- Know what UX is, and why it is important\n","Spots Remaining":1,"Department":"Communications"},{"Timestamp":"","Title":"Photographer","Detailed Description":"UTMIST puts great efforts on benefiting more people with current resources we have. Therefore, it’s vital to keep visual records of our self-created workshop series, projects, as well as guest speaker talks. Photographers will\n- Take turns to attend UTMIST events in person and record the audio/video of event content\n- Record memorable moments of events and project teams \n- Curate pictures and build a gallery of UTMIST \n\nWhy would you want to be a photographer at UTMIST?\n- Spread valuable information to more audience, especially students thirsty for knowledge and opportunities \n- Work with many other prospective students while having your own unique skill in the team\n\nWhat we are looking for\n- Understood framing, color and light to create a visually pleasing photograph\n- (Amateur or beyond) Journalistic photography skill\n- Adequate commitment to physically attend the events \n","Spots Remaining":2,"Department":"Communications"},{"Timestamp":"","Title":"VP Logistics","Detailed Description":"The role of VP Logistics is crucial to the operation of the club in that it deals extensively with behind-the-scenes tasks, underpinning the events and missions to be carried out downstream. \n\nThe role of VP Logistics requires strong coordination and scheduling skills. As surprising as it may seem, interpersonal skills are just as important and frequently used. To see why this is the case, let's proceed to the list of responsibilities below. \n\n1.  Manage club membership at ULife, UTSU and EngSoc. File membership applications at these organizations. Regulate usage of our club office space. Deal with the mandatory tasks that ULife gives to a club office space owner, either by completing it within department or by delegating it to members in other departments. \n\n2. Plan events for the club. In past years, events were mostly planned by the externals and academics departments, because the nature of the event was either inviting an external guest to give a talk, or giving a lecture on ML basics just by ourselves. However, this coming year, we are looking to include events in the form of hackathons and networking, so the logistics department can take on the duty of carrying out events of such kind. Of course, what could be more exciting is for you to come up with new ideas for events that have never been conceived, and making them come true. There lies huge potential. \n\n3. Assign deadlines to tasks for each department in the club in order to ensure successful and timely execution of a specific event. Supervise the completion of each task. Adjust the deadlines to unforeseen changes. \n\n4. Book rooms, media equipment and food & refreshments for events. Set up on-site media equipment for each event. \n\n5. Collect feedback and report them to the relevant departments. \n\n6. Organize in-club socials. \n","Spots Remaining":1,"Department":"Logistics"},{"Timestamp":"","Title":"VP External","Detailed Description":"We are recruiting VP External, we hope you are enthusiastic, have a great sense of responsibility, capable of multitasking, have great communication (both oral and written) skills in English, great if with past experience in Public Relations and Sponsorship. \n\nYour responsibilities: \n- Seeking external opportunities and potential collaborations with university departments and clubs, companies and institutions;\n- reaching out to academic and industry speakers for various events and competitions;\n- Seek sponsorships from organizations outside of the University of Toronto;\n- Collaborate with other president and other VPs for club events and affairs;\nmaintaining positive and active public image of the club\n\nAdditional Duties include:\n- Appoint External Associate(s)/Director(s) to assist in maintaining sponsorship package, seeking and reaching out to potential sponsors and collaborators, maintaining and fostering professional relationships with potential sponsors and current sponsors. Ideal candidates shall demonstrate strong communication skills and interpersonal skills. Previous experience with sponsorship package is preferred. \n","Spots Remaining":1,"Department":"External"},{"Timestamp":"","Title":"External Associates","Detailed Description":"Work with VP External to seek sponsorship opportunities \nCoordinate with Logistics team to prepare for events\nWork with VP External and Marketing team to facilitate and establish external connections with industry and academia communities.\nRequires great communication skills. Past experience in managing external relations or sponsorship for organizations would be a plus\n","Spots Remaining":2,"Department":"External"},{"Timestamp":"","Title":"VP Finance","Detailed Description":"- Being a vice president, discuss on meetings with president and other vps to make decisions on UTMIST’s directions\n- Lead the sector of finance to maintain oversee club’s budget and provide strategic plans to maintain a healthy financial position.\n- Work with VP Sponsorship to secure sponsorship opportunities\n\nWhat we are looking for\n- Previous experience dealing with EngSoc or UTSU\n- Previous experience in VP finance position\n- Accounting experience would be a plus \n","Spots Remaining":1,"Department":"Finance"},{"Timestamp":"","Title":"Marketing Associates","Detailed Description":"There are two major roles as a marketing associate:\n\nMarketing Associates (Content Provider)\n- Develop and implement strategies with marketing team\n- Contribute to collaborative efforts and organize promotional events\n- Conduct market research to identify new opportunities\n- Coordinate with the Academic and External teams to prepare advertising contents\n\nMarketing Associates (Social Network Platform Management)\n- Develop and implement strategies with marketing team\n- Contribute to collaborative efforts and organize promotional \n- Conduct market research to identify new opportunities\n- Coordinate with the Design and Content teams to make advertising post on Social Networks\n","Spots Remaining":2,"Department":"Marketing"}]