[{"Timestamp":"6/16/2019 16:58:40","Title":"Technical Writer","Detailed Description":"Technical writers have a mission to bring UTMIST resources beyond the University of Toronto Campus. \n\nResponsibility: \n- Attend UTMIST learning events in person\n- Utilize UTMIST and online resources to fully understand the material\n- Produce high-quality articles on our Medium platform\n\nWhy would you want to become a technical writer?\n- A great way to learn if you are not yet ready to do projects\n- Demonstrate soft skills to employers\n- Potential to join project teams after\n\nWhat we are looking for\n- Strong writing skills\n- Solid fundamentals in mathematics and probably programming. Machine learning experience not required\n- Unstoppable curiosity","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Web Developer","Detailed Description":"UTMIST is actively exploring possibilities on the web platform to improve the experience of sponsors, speakers, and students.\n \nResponsibility: \n- Develop new features of UTMIST’s online presence\n- Iterate on the existing web code base for changing needs\n- Suggest different ways to improve UTMIST’s online experience\n\nWhy would you want to be a web developer at UTMIST?\n- Deployment on the web is the last mile for any ML model\n- You will be mentored by a web developer with industry experience\n- Potential to collaborate with project teams to productionize findings\n\nWhat we are looking for\n- You know AI and are interested in Web, or know Web and are interested in AI\n- Strong software development background\n- Know what UX is, and why it is important","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Photographer","Detailed Description":"UTMIST puts great efforts on benefiting more people with the current resources we have. Therefore, it’s vital to keep visual records of our self-created workshop series,  projects, as well as guest speaker talks. \n\nResponsibility: \n- Take turns to attend UTMIST events in person and record the audio/video of event content\n- Record memorable moments of events and project teams visually \n- Curate pictures and build a gallery of UTMIST \n\nWhy would you want to be a photographer at UTMIST?\n- Spread valuable information to a larger audience, especially students thirsty for knowledge and opportunities \n- Work with many other prospective students while having your own unique skill in the team\n\nWhat we are looking for\n- Understood framing, color and light to create a visually pleasing photograph\n- (Amateur or beyond) Journalistic photography skill\n- Adequate commitment to physically attend the events ","Spots Remaining":null,"Department":"Communications"},{"Timestamp":"","Title":"Logistic Associates","Detailed Description":"Logistics Department Collective Responsibilities\n- Work with other VPs to design events for members to develop machine learning knowledge\n- Assign deadlines to tasks for each department in the club in order to ensure successful and timely execution of a specific event. Supervise the completion of each task. Adjust the deadlines to unforeseen changes. \n- Manage club membership at ULife, UTSU and EngSoc. Execute mandatory tasks that ULife gives to maintain UTMIST as an official club office space owner.\n- Book rooms, media equipment and food & refreshments for events. Work with External Onsite Associate to set up events on site\n- Organize team socials and team building events \n- Collect feedback and report them to the relevant departments\n\nWhy would you want to be a Logistics Associate at UTMIST?\n- Opportunity to build connections with other execs who are driven and passionate in ML \n- Opportunity to represent UTMIST at events and network with invited professionals\n- Apply your invisible qualities(patience, detail-oriented, people skills) to improve the result of UTMIST event\n\nWhat we are looking for \n- Strong coordination and scheduling skills\n- Interpersonal skills\n- Creativity and experience in event programming\n- Detail-oriented ","Spots Remaining":null,"Department":"Logistics"},{"Timestamp":"","Title":"Marketing Associates","Detailed Description":"Responsibility:\n- Develop and implement strategies with the marketing team\n- Contribute to collaborative efforts and organize promotional events\n- Conduct market research to identify new opportunities\n- Coordinate with the Academic and External teams to prepare advertising contents\n- Coordinate with the Design and Content teams to make advertising post on Social Networks\n\nWhy would you want to be a marketing associate?\n- Grow your creativity\n- Grow your ability to attract attention delightfully and promote valuable ideas\n- Work extensively with teammates, develop communication skills and efficient teamwork\n\nWhat we are looking for (as an ideal candidate) \n- Excellent English or Mandarin writing skills \n- Time-management and organizational skills\n- Previous experience in article writing\n- Creativity and marketing sense is a plus","Spots Remaining":null,"Department":"Marketing"},{"Timestamp":"","Title":"Graphics Designer","Detailed Description":"Responsibility:\n- Design posters for event promotions\n- Manage the consistency of graphic style of UTMIST publications (newsletter, sponsorship package, website, logo, banner etc. )\n\nWhy would you want to be a graphic designer at UTMIST?\n- Help promote a meaningful club and its events \n- Enrich your profile by contributing to more designs\n- Grow aesthetic judgement and design skills\n- Work closely with a group of students who have insights and knowledge of ML\n\nWhat we are looking for \n- Familiar with basic digital graphics design tools (e.g. Photoshop, Illustrator).\n- Prior experience in graphic design is desirable but not mandatory","Spots Remaining":null,"Department":"Marketing"},{"Timestamp":"","Title":"Project Directors ","Detailed Description":"Responsibility: \n- Lead a term-based project as part of our effort towards contributing to the ML/AI community. (You/Your Project members are free to choose your topic of interest and pursue an exciting learning/practicing experience as a team. )\n- Set project milestones and goals, report progress to VP Academics.\n- Provide guidance and technical support to team members, encourage close teamwork and make sure the team is on the same pace\n\nWhy would you want to be a Project Director at UTMIST?\n- Able to learn effective teamwork and leadership \n- Go in-depth on machine learning and specifically on your selected topic\n- Enrich your profile with a brilliant machine learning project and unique leadership experience \n- Connect with and learn from motivated peers. \n\nWhat we are looking for? \n- Motivated, responsible and enjoy teamwork\n- (Strongly suggest) have ideas in mind that you want to pursue + prior knowledge in related domains, which will be of great help to the success of the project","Spots Remaining":null,"Department":"Academics"},{"Timestamp":"","Title":"Project Associates","Detailed Description":"Responsibility: \n- Assist VP Academics and the project directors in terms of event preparation and internal projects. (You have the option to focus on either or both as long as your time/commitment permits.)\n\nWhy would you want to be a Project Associate at UTMIST?\n- A great way to kick-start your learning in ML/AI\n- Meet with passionate peers, enrich your exposure to the diversity of the field \n- Every member will have prioritized opportunities to join our workshops/reading groups/other events, so you can get a unique advantage in learning and networking. \n\nWhat we are looking for\n- Passionate about machine learning but most importantly willing to learn\n- Enjoy the teamwork and responsible \n- Prior experience in ML or software development will be a bonus","Spots Remaining":null,"Department":"Academics"},{"Timestamp":"","Title":"External Associates (Public Relations)","Detailed Description":"Responsibility:\n- Work with VP External to find and attract professionals or organizations that may have an interest in supporting UTMIST\n- Help VP External with reaching out to external resources and preparing sponsorship package\n\nWhy would you want to be an External PR Associate at UTMIST?\n- Make connections with graduate students, professors, industry experts in AI/ML field\n- Able to learn from an experienced VP External closely\n- Have lots of opportunities to practice and grow effective communication skills\n- And MORE!\n\nWhat we are looking for\n- Passionate at communicating in English (both formally and casually)\n- An enthusiastic attitude\n- A great sense of responsibility\n- Past experience in Public Relations and Sponsorship is an asset","Spots Remaining":null,"Department":"External"}]